Table of Contents
 Enum Plane
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Defines basic planes
public enum Plane
Fields
XY = 0
XY Plane - Plane normal to Z axis
YZ = 1
YZ Plane - Plane normal to X axis
ZX = 2
ZX Plane - Plane normal to Y axis
Fields
 Name |  Description
 XY = 0
XY Plane - Plane normal to Z axis
 YZ = 1
YZ Plane - Plane normal to X axis
 ZX = 2
ZX Plane - Plane normal to Y axis
 Edit this page